app/controllers/api/v1/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    render json: { games: Game.all }